Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: How can I send text to a window which isn't active or isn't visible?
fr: Comment puis-je envoyer du texte à une fenêtre qui n'est pas active ou pas visible ?

source: How can I send the current Date and/or Time?
fr: Comment puis-je envoyer la date et/ou l'instant actuels ?

source: How can I start an action when a window appears, closes or becomes [in]active?
fr: Comment puis-je démarrer une action quand une fenêtre apparaît, se ferme ou devient (in)active ?

source: How can I use a hotkey that is not in my keyboard layout?
fr: Comment puis-je utiliser une hotkey qui n'est pas dans ma disposition clavier ?

source: How can Tab and Space be defined as hotkeys?
fr: Comment définir des hotkeys avec la tabulation ou la barre espace ?

source: How can Winamp be controlled even when it isn't active?
fr: Comment contrôler Winamp même sans qu'il soit actif ?

source: How can a hotkey or hotstring be made exclusive to certain program(s)?
fr: Comment rendre une hotkey ou un hotstring exclusif à certains programmes ?

source: How can a prefix key be made to perform its native function rather than doing nothing?
fr: Comment une touche préfixe peut-elle garder sa fonction native au lieu de ne rien faire ?

source: How can a repeating action be stopped without exiting the script?
fr: Comment arrêter une action répétée sans quitter le script ?

source: How can a script close, pause, suspend or reload other script(s)?
fr: Comment un script peut-il fermer, mettre en pause, suspendre ou recharger d'autres scripts ?

source: How can context sensitive help for AutoHotkey commands be used in any editor?
fr: Comment utiliser de l'aide sensible au contexte pour les commandes AutoHotkey dans un éditeur quelconque ?

source: How can dates and times be compared or manipulated?
fr: Comment comparer ou manipuler les dates et le temps ?

source: How can keys or mouse buttons be remapped so that they become different keys?
fr: Comment réaffecter des touches ou des boutons de la souris afin qu'elles deviennent des touches différentes ?

source: How can performance be improved for games or at other times when the CPU is under heavy load?
fr: Comment améliorer les performances pour des jeux ou autre quand le processeur est très demandé ?

source: How can tab and space be defined as hotkeys?
fr: Comment définir des hotkeys avec la tabulation ou la barre espace ?

source: How can the built-in Windows shortcut keys, such as Win+U (Utility Manager) and Win+R (Run), be changed or disabled?
fr: Comment changer ou désactiver les touches de raccourcis Windows intégrées, comme Win+U (options d'affichage) et Win+R (Exécuter) ?

source: How can the output of a command line operation be retrieved?
fr: Comment récupérer la sortie d'une opération en ligne de commande ?

source: How do I detect the double press of a key or button?
fr: Comment détecter un double appui d'une touche ou d'un bouton ?

source: How do I put my hotkeys and hotstrings into effect automatically every time I start my PC?
fr: Comment faire pour que mes hotkeys et hotstrings soient activés dès le démarrage de mon ordinateur ?

source: How do I restore the right-click context menu options for .ahk files?
fr: Comment restaurer les options du menu contextuel du clic droit pour les fichiers .ahk ?

source: How do I work around problems caused by User Account Control (UAC)?
fr: Comment contourner les problèmes engendrés par le contrôle du compte d'utilisateur (UAC) ?

source: How to create a script
fr: Comment créer un script

source: How to detect when a web page is finished loading?
fr: Comment détecter quand une page web a fini de charger ?

source: How to find the flaws in a misbehaving script.
fr: Trouver les problèmes dans un script au mauvais comportement.

source: How to find the help file on your computer
fr: Comment trouver le fichier d'aide sur l'ordinateur

source: How to use AutoHotkey, in general.
fr: Comme utiliser AutoHotkey, en général.

source: How to use the program
fr: Comment utiliser le programme

source: However there are methods that can increase the chance of working in some games, but there is no magical "make it work in my game now!!!" button.
fr: Bien qu'il existe des méthodes augmentant les chances de fonctionnement pour certains jeux, il n'y a pas de recette miracle "faites que ça marche tout de suite !!!".

source: However, {(A):
fr: Toutefois, {(A):

source: However, a standalone function call cannot be followed by an open brace { (at the end of the line or on the next line), because it would be confused with a function declaration.
fr: Toutefois, un appel de fonction isolé ne peut pas être suivi par une accolade ouvrante { (à la fin de la ligne ou sur la prochaine ligne), car il y aurait confusion avec une déclaration de fonction.

source: However, comments can be included on the bottom and top lines of the section.
fr: Toutefois, des commentaires peuvent être inclus sur les lignes en bas et en haut de la section.

source: However, hotkeys with the # modifier can be triggered by either Win key.
fr: Cependant, les hotkeys avec le modificateur # peuvent être déclenchés par l'une ou l'autre des touches Win.

source: However, in AutoHotkey v1, ++, --, +=, -=, *= and /= have slightly different behavior when used alone on a line, as they are actually equivalent to EnvAdd, EnvSub, EnvMult or EnvDiv.
fr: Toutefois, dans AutoHotkey v1, ++, --, +=, -=, *= et /= ont des comportement légèrement différents quand ils sont utilisés seuls sur une ligne, puisqu'ils sont actuellement équivalents à EnvAdd, EnvSub, EnvMult ou EnvDiv.

source: However, in AutoHotkey v1, command names take precedence.
fr: Toutefois, dans AutoHotkey v1, les noms de commande ont la priorité.

source: However, in the absence of hotkeys and hotstrings, a script will perform its commands sequentially from top to bottom the moment it is launched.
fr: Toutefois, en l'absence de hotkeys et de hotstrings, un script effectuera ses commandes dans l'ordre du haut vers le bas à l'instant où il est lancé.

source: However, it may make more sense to think of %second% as being replaced with the contents of the variable second in both cases:
fr: Toutefois, il peut sembler plus logique de voir %deuxième% comme remplacé par le contenu de la variable deuxième dans les deux cas :

source: However, several commands have a function replacement.
fr: Toutefois, plusieurs commandes ont une fonction les remplaçant.

source: However, spaces are significant in some cases, including:
fr: Toutefois, les espaces sont importants dans quelques cas, y compris :

source: However, the Alt+CapsLock, Ctrl+CapsLock and Shift+CapsLock shortcuts can be disabled with a workaround.
fr: Cependant, les touches Alt+Verr Maj, Ctrl+Verr Maj et Maj+Verr Maj raccourcis peuvent être désactiver avec une solution de contournement.

source: However, the prefix is not supported in the Var parameters of legacy If commands, so If (expression) should be used instead.
fr: Toutefois, ce préfixe n'est pas pris en charge pour les paramètres Var des commandes If dépassées (legacy), donc If (expression) devrait être utilisée à la place.

source: However, there usually must be a matching ) on the same line, otherwise the line would be interpreted as the start of a continuation section.
fr: Toutefois, il doit en général y avoir une ) complémentaire sur la même ligne, sinon la ligne serait interprétée comme le début d'une section de continuation.

source: However, these variables cannot be referenced directly in an expression because they would be seen as numbers rather than variables.
fr: Toutefois, ces variables ne peuvent pas être utilisées directement dans une expression puisqu'elles seraient interprétées comme des nombres plutôt que comme des variables.

source: However, unless parentheses are used (as in a method call), this cannot be the prefix of a larger expression.
fr: Toutefois, sauf si des parenthèses sont utilisées (comme pour un appel de méthode), ceci ne peut pas être le préfixe d'une expression plus longue.

source: However, variables cannot be used inside a quoted string.
fr: Toutefois, les variables ne peuvent pas être utilisées dans une chaîne entre guillemets.

source: However, when a script launches a program or document, the operating system usually requires quotes around any command-line parameter that contains spaces, such as in this example:
fr: Toutefois, quand un script lance un programme ou un document, le système d'exploitation a souvent besoin des guillemets autour de tout paramètre de ligne de commande qui contient des espaces, comme dans cet exemple :

source: However, within the AutoHotkey documentation, "subroutine" typically refers to the kind of subroutine defined by a label (described above).
fr: Toutefois, dans la documentation AutoHotkey, "sous-programme" fait typiquement référence au genre de sous-programme défini par un label (décrit ci-dessus).

source: However:
fr: Toutefois :

source: I can't edit my script via tray icon because it won't start due to an error.
fr: Je ne peux pas modifier mon script en passant par l'icône de la zone de notifications car une erreur empêche mon script de se lancer.

source: I hope you have learned something.
fr: J'espère qu'il a été instructif.

source: I'm having trouble getting my mouse buttons working as hotkeys.
fr: J'ai du mal à faire fonctionner mes boutons de souris comme hotkeys.

source: I've upgraded my computer/Windows and now my script won't work.
fr: J'ai amélioré mon ordinateur/mis à jour Windows et maintenant mon script ne fonctionne plus.

source: If var is type ignores the system locale by default
fr: Si var est type ignore les paramètres régionaux du système par défaut

source: If Length is omitted it defaults to 1.
fr: Si Longueur n'est pas précisé, il vaut par défaut 1.

source: If NumLock is OFF but Shift is pressed, the system temporarily releases Shift and acts as though NumLock is ON.
fr: Si Verr Num est désactivé mais que Maj est enfoncé, le système libère temporairement Maj et agit comme si Verr Num était activé.

source: If mpress.exe is present in the "Compiler" subfolder where AutoHotkey was installed, it is used automatically unless it is disabled via /mpress 0 or the GUI setting.
fr: Si mpress.exe est présent dans le sous-dossier "Compiler" où AutoHotkey a été installé, il est utilisé automatiquement à moins d'être désactivé avec /mpress 0 ou le paramètre de l'interface graphique.

source: If AutoHotkey is pinned to the taskbar or Start menu on Windows 7 or later, recent or pinned scripts can be launched via the program's Jump List.
fr: Si AutoHotkey est épinglé à la barre des tâches ou au menu Démarrer à partir de Windows 7, les scripts récents ou épinglés peuvent être exécutés via la liste de raccourcis du programme.

source: If AutoHotkey was previously installed, the installer automatically detects which version of AutoHotkey.exe to set as the default.
fr: Si AutoHotkey était déjà installé, l'installateur détecte automatiquement quelle version de AutoHotkey.exe définir par défaut.

source: If Statement
fr: Instruction If

source: If Var = Text value
fr: If Var = Valeur textuelle

source: If Var [not] between Lower and Upper
fr: If Var [not] between Inférieur and Supérieur

source: If Var [not] in/contains MatchList
fr: If Var [not] in/contains ListeChoix

source: If a closing parenthesis appears in the continuation section's options (except as a parameter of the Join option), the line is reinterpreted as an expression instead of the beginning of a continuation section.
fr: Si une parenthèse fermante apparaît dans les options d'une section de continuation (sauf en paramètre de l'option Join), la ligne est ré-interprétée comme une expression au lieu du début d'une section de continuation.

source: If a file contains other code, one can avoid breaking the auto-execute section by skipping over the file's contents with Goto.
fr: Si un fichier contient du code supplémentaire, terminer la section d'auto-exécution peut être évité en sautant le contenu du fichier avec Goto.

source: If a game has a cheat prevention system and your hotkeys, hotstrings and Send commands do not work, you are out of luck.
fr: Si un jeu dispose d'un système anti-triche et que les hotkeys, hotstrings et commandes Send ne fonctionnent pas, pas de chance.

source: If a script used these characters in variable names in expressions, generally the script will run without displaying an error message, but will misbehave as the characters will be interpreted as operators rather than as part of a variable name.
fr: Si un script a utilisé ces caractères dans des noms de variables dans des expressions, le script s'exécutera généralement sans afficher de message d'erreur, mais se comportera mal car les caractères seront interprétés comme des opérateurs plutôt que comme faisant partie d'un nom de variable.

source: If a script's Hotkeys, Clicks, or Sends are noticeably slower than normal while the CPU is under heavy load, raising the script's process-priority may help.
fr: Si les Hotkeys, Clicks, ou Sends d'un script sont sensiblement plus lents qu'en temps normal quand le processeur est très sollicité, augmenter la priorité du processus du script peut aider.

source: If all these fail, it may not be possible for AHK to work with your game.
fr: Si toutes échouent, il est possible qu'AutoHotkey ne fonctionne pas avec le jeu en question.

source: If an inner loop is enclosed by an outer loop, the inner loop takes precedence.
fr: Si une boucle interne est à l'intérieur d'une boucle externe, la boucle interne prend la priorité.

source: If any these UIA files are present before installation, the installer will automatically update them even if the UI Access option is not enabled.
fr: Si un de ces fichiers UIA est présent avant installation, l'installateur les mettra automatiquement à jour même si l'option UI Access (accès UI) n'est pas activée.

source: If everything you try fails, it may not be possible to use AutoHotkey for your needs.
fr: Si toutes les solutions tentées échouent, il est possible que AutoHotkey ne puisse simplement pas être utilisé.

source: If in doubt, it is best to always begin the expression with an open-parenthesis.
fr: Dans le doute, il est mieux de toujours commencer l'expression avec une parenthèse ouvrante.

source: If in doubt, use lowercase.
fr: Dans le doute, utiliser les minuscules.

source: If in doubt, you could send the file to the vendor of your antivirus software for confirmation.
fr: Dans le doute, le fichier peut être envoyé à l'éditeur du logiciel antivirus pour confirmation.

source: If it does not, the default return value is an empty string.
fr: Si elle ne le fait pas, la valeur de retour par défaut est une chaîne de caractères vide.

source: If it's not in the chart, it does not need brackets.
fr: Si ce n'est pas dans le tableau, pas besoin d'accolades.

source: If more than one option is present, separate each one from the previous with a space.
fr: Si plus d'une option est présente, elles sont séparées par des espaces.

source: If omitted (such as if you run AutoHotkey directly from the Start menu), the program looks for a script file called AutoHotkey.ahk in the following locations, in this order:
fr: Si omis (par exemple si AutoHotkey est exécuté directement depuis le menu Démarrer), le programme cherche un fichier de script appelé AutoHotkey.ahk dans les endroits suivants, dans cet ordre :

source: If one form of Send does not work for your needs, try another type of Send.
fr: Si une forme de Send n'est pas adaptée, essayer une autre forme de Send.

source: If so, SUCCESS!
fr: Si c'est le cas, SUCCES !

source: If that did not yield results that satisfy you, read below.
fr: Si un problème ou une question subsiste, lire ci-dessous.

source: If that doesn't work, you can open the file in Notepad or another editor.
fr: Si ça ne fonctionne pas, le fichier peut être ouvert avec Notepad ou un autre éditeur.

source: If the "out" file is omitted, the EXE will have the same base filename as the script itself.
fr: Si le fichier de sortie "out" est omis, l'EXE aura le même nom de fichier de base que le script.

source: If the /CPn switch is passed on the command-line, codepage n is used.
fr: Si le commutateur /CPn est passé en ligne de commande, le codepage n est utilisé.

source: If the Join string ends with a colon, it must not be the last option on the line.
fr: Si la chaîne de caractères indiquée à Join finit par un deux-points, ce ne doit pas être la dernière option sur la ligne.

source: If the auto-execute section takes a long time to complete (or never completes), the default values for the above settings will be put into effect after 100 milliseconds.
fr: Si la section d'auto-exécution prend longtemps à terminer (ou ne termine jamais), les valeurs par défaut des paramètres ci-dessus prendront effet après 100 millisecondes.

source: If the caller does not pass a variable, the parameter acts as a normal local variable.
fr: Si l'appelant ne passe pas de variable, le paramètre agit comme une variable locale normale.

source: If the computer has more than one joystick and you want to use one beyond the first, include the joystick number (max 16) in front of the control name.
fr: Si l'ordinateur possède plus d'un joystick et que vous voulez en utiliser un au-delà du premier, incluez le numéro du joystick (max 16) devant le nom du contrôle.

source: If the file begins with a UTF-8 or UTF-16 (LE) byte order mark, the appropriate codepage is used and the /CPn switch is ignored.
fr: Si le fichier commence par un indicateur d'ordre des octets (Byte Order Mark) UTF-8 ou UTF-16 (LE), le codepage approprié est utilisé et le commutateur /CPn est ignoré.

source: If the number of parameters passed into a script varies (perhaps due to the user dragging and dropping a set of files onto a script), the following example can be used to extract them one by one:
fr: Si le nombre de paramètres passés à un script est variable (par exemple l'utilisateur glisse-dépose un ensemble de fichiers sur un script), l'exemple suivant peut être utilisé pour les extraire un par un :

source: If the optional parentheses are present, they may contain parameters for the object's __New method.
fr: Si les parenthèses optionnelles sont présentes, elles peuvent contenir des paramètres pour la méthode __New de l'objet.

source: If the output file exists, it is overwritten.
fr: Si le fichier de sortie existe, il est remplacé.

source: If the parameters are file names, the following example can be used to convert them to their case-corrected long names (as stored in the file system), including complete/absolute path:
fr: Si les paramètres sont des noms de fichier, l'exemple suivant peut être utilisé pour les convertir en leurs noms longs avec casse corrigée (tel que stocké dans le système de fichier), comprenant le chemin complet/absolu :

source: If the program you are trying to start is in %A_WinDir%\System32 and you are using AutoHotkey 32-bit on a 64-bit system, the File System Redirector may be interfering.
fr: Si le programme à exécuter est dans %A_WinDir%\System32 et que AutoHotkey 32-bit est utilisé sur un système 64-bit, le File System Redirector (redirecteur du système de fichiers) peut interférer.

source: If the script contains syntax errors, the output file may be empty.
fr: Si le script contient des erreurs de syntaxe, le fichier de sortie peut être vide.

source: If the script is already running, you can use the Edit command or right-click the script's tray icon and select Edit This Script.
fr: Si le script est en cours d'exécution, la commande Edit peut être utilisée, ainsi qu'un clic droit sur l'icône en zone de notification du script puis clic sur Edit This Script.

source: If the word Join is specified by itself, lines are connected directly to each other without any characters in between.
fr: Si le mot Join est indiqué seul, les lignes sont jointes directement sans aucun caractère entre.

source: If they cannot be seen -- or if your mouse has more than five buttons that you want to use -- you can try configuring the software that came with the mouse (sometimes accessible in the Control Panel or Start Menu) to send a keystroke whenever you press one of these buttons.
fr: S'ils ne sont pas visibles -- ou si la souris a plus de cinq boutons à utiliser -- il est possible d'essayer de configurer le logiciel fourni avec la souris (parfois accessible dans le Panneau de configuration ou le menu Démarrer) afin qu'il envoie des frappes à chaque appui sur un de ces boutons.

source: If they do, there is a high chance that AutoHotkey will not work with that game.
fr: Dans ce cas, il y a de grandes chances que AutoHotkey ne fonctionne pas avec ce jeu.

source: If this function is present, the /E switch can be used to invoke it from the command line.
fr: Si cette fonction est présente, le commutateur /E peut être utilisé à cet effet en ligne de commande.

source: If this is the case, you cannot directly make that particular key a hotkey because your keyboard driver or hardware handles it at a level too low for AutoHotkey to access.
fr: Si tel est le cas, vous ne pouvez pas directement faire de cette touche particulière un hotkey car votre pilote de clavier ou votre matériel le gère à un niveau trop bas pour que AutoHotkey aye accès.

source: If this option is omitted, each line except the last will be followed by a linefeed character (`n).
fr: Si cette option est omise, chaque ligne sauf la dernière sera suivie d'un caractère retour à la ligne (`n).

source: If unset, the standard defaults will apply (as documented on each of the following pages):
fr: Si non spécifiées, les valeurs par défaut standards sont utilisées (ainsi que documenté sur chacune des pages suivantes) :

source: If used within a function, the resulting pseudo-array is either entirely global or entirely local, depending only on the first element (or base name) of the array.
fr: Utilisées dans une fonction, le pseudo-tableau résultant est soit entièrement global soit entièrement local, uniquement selon le premier élément (ou le nom de base) du tableau.

source: If you are having issues and you know the game uses DirectX, try the stuff described on the FAQ page.
fr: Si il est su qu'un jeu utilise DirectX et que le jeu pose problème, essayer les propositions détaillées dans la FAQ.

source: If you are running another AutoHotkey executable directly, the name of the script depends on the executable.
fr: Dans le cas où un autre exécutable AutoHotkey serait directement utilisé, le nom du script dépend de l'exécutable.

source: If you are using AutoHotkey without having installed it, look in the directory which contains AutoHotkey.exe.
fr: Si AutoHotkey est utilisé sans avoir été installé, regarder dans le dossier qui contient AutoHotkey.exe.

source: If you don't get an answer right away, wait at least 1 day (24 hours) before asking for more help.
fr: Sans aucune réponse, attendez au moins une journée (24 heures) avant de redemander de l'aide.

source: If you get a UAC prompt, hold Ctrl or Shift as you click Yes/Continue.
fr: Si il s'affiche une fenêtre de contrôle de compte de l'utilisateur (UAC), maintenir Ctrl ou Shift en cliquant sur Oui/Continuer.

source: If you get confused, try reading the section again.
fr: Si c'est confus, essayer de relire la section.

source: If you have a five-button mouse whose fourth and fifth buttons cannot be seen, you can try changing your mouse driver to the default driver included with the OS.
fr: Si les quatrième et cinquième boutons d'une souris ne sont pas visibles, il est possible de changer le pilote de la souris vers le pilote par défaut inclus avec l'OS.
